import { importDoc } from '@utils/formatters';
import type { IDocumentsList, IDocumentsListGroup } from '@utils/types';

export const infoOwnershipStructure: IDocumentsListGroup[] = [
	{
		groupTitle: '2024',
		list: [
			{
				title:
					' Схематичне зображення структури власності ТОВ "СМАРТФІНАНС" станом на 01.01.2024 (розміщено) ',
				link: importDoc('doc_99021.pdf'),
			},
			{
				title:
					' Відомості про остаточних ключових учасників у структурі власності надавача фінансових послуг ТОВ "СМАРТФІНАНС" станом на 01.01.2024 (розміщено) ',
				link: importDoc('doc_99022.pdf'),
			},
			{
				title:
					' Відомості про власників істотної участі в надавачі фінансових послуг ТОВ "СМАРТФІНАНС" станом на 01.01.2024 (розміщено)   ',
				link: importDoc('doc_99023.pdf'),
			},
			{
				title:
					'Схематичне зображення структури власності ТОВ "СМАРТФІНАНС" станом на 15.04.2024 (розміщено)  ',
				link: importDoc('doc_103074.pdf'),
			},
			{
				title:
					'Відомості про остаточних ключових учасників у структурі власності надавача фінансових послуг ТОВ "СМАРТФІНАНС" станом на 15.04.2024 (розміщено)  ',
				link: importDoc('doc_103075.pdf'),
			},
			{
				title:
					'Відомості про власників істотної участі в надавачі фінансових послуг ТОВ "СМАРТФІНАНС" станом на 15.04.2024 (розміщено)  ',
				link: importDoc('doc_103076.pdf'),
			},
		],
	},
	{
		groupTitle: '2023',
		list: [
			{
				title:
					' Схематичне зображення структури власності ТОВ "СМАРТФІНАНС" станом на 01.01.2023 (розміщено)',
				link: importDoc('doc_98389.pdf'),
			},
			{
				title:
					'Відомості про остаточних ключових учасників у структурі власності надавача фінансових послуг ТОВ "СМАРТФІНАНС" станом на 01.01.2023 (розміщено)  ',
				link: importDoc('doc_98391.pdf'),
			},
			{
				title:
					'Відомості про власників істотної участі в надавачі фінансових послуг ТОВ "СМАРТФІНАНС" станом на 01.01.2023 (розміщено)  ',
				link: importDoc('doc_98390.pdf'),
			},
		],
	},
];

export const financeReports: IDocumentsListGroup[] = [
	{
		groupTitle: '2022',
		list: [
			{
				title: 'Фінансова звітність за 2022 рік (розміщено)  ',
				link: importDoc('doc_95338.pdf'),
			},
			{
				title: 'Аудиторський висновок за 2022 рік (розміщено) ',
				link: importDoc('doc_95339.pdf'),
			},
		],
	},
	{
		groupTitle: '2021',
		list: [
			{
				title: 'Фінансова звітність за 2021 рік (розміщено 14.10.2022)   ',
				link: importDoc('doc_91432.pdf'),
			},
			{
				title: 'Аудиторський висновок за 2021 рік (розміщено 14.10.2022)',
				link: importDoc('doc_91433.pdf'),
			},
		],
	},
	{
		groupTitle: '2020',
		list: [
			{
				title: 'Фінансова звітність за 2020 рік (розміщено 27.04.2021)',
				link: importDoc('doc_82798.pdf'),
			},
			{
				title: 'Аудиторський висновок за 2020 рік (розміщено 30.04.2021)',
				link: importDoc('doc_83542.pdf'),
			},
		],
	},
	{
		groupTitle: '2019',
		list: [
			{
				title: 'Фінансова звітність за 2019 рік (розміщено 29.04.2020) ',
				link: importDoc('doc_73719.pdf'),
			},
			{
				title: 'Аудиторський висновок за 2019 рік (розміщено 29.04.2020)  ',
				link: importDoc('doc_73720.pdf'),
			},
		],
	},
	{
		groupTitle: '2018',
		list: [
			{
				title: 'Фінансова звітність за 2018 рік (розміщено 26.04.2019) ',
				link: importDoc('doc_65561.pdf'),
			},
			{
				title:
					'Примітки до фінансової звітності за 2018 рік (розміщено 26.04.2019)',
				link: importDoc('doc_65562.pdf'),
			},
			{
				title: 'Аудиторський висновок за 2018 рік (розміщено 26.04.2019) ',
				link: importDoc('doc_65563.pdf'),
			},
		],
	},
	{
		groupTitle: '2017',
		list: [
			{
				title: 'Фінансова звітність за 2017 рік (розміщено 27.04.2018)',
				link: importDoc('doc_56753.xls'),
			},
			{
				title:
					'Примітки до фінансової звітності за 2017 р. (розміщено 27.04.2018)  ',
				link: importDoc('doc_56754.docx'),
			},
			{
				title: 'Аудиторський висновок за 2017 рік (розміщено 27.04.2018)',
				link: importDoc('doc_56756.doc'),
			},
		],
	},
	{
		groupTitle: '2016',
		list: [
			{
				title: 'Фінансова звітність за 2016 р. (розміщено 10.03.2017)',
				link: importDoc('doc_45226.pdf'),
			},
			{
				title: 'Аудиторський висновок за 2016 рік (розміщено 28.04.2017) ',
				link: importDoc('doc_48171.docx'),
			},
		],
	},
	{
		groupTitle: '2015',
		list: [
			{
				title:
					'Фінансова звітність та аудиторський висновок за 2015 р (розміщено 19.04.2016)',
				link: importDoc('doc_38128.pdf'),
			},
		],
	},
];

export const archivedInformation: IDocumentsList[] = [
	{
		title:
			'Примірний договір про надання коштів у позику, у тому числі на умовах фінансового кредиту (дійсний до 01.09.2022) (розміщено) ',
		link: importDoc('doc_90934.pdf'),
	},
	{
		title:
			'Правила надання коштів у позику, в тому числі і на умовах фінансового кредиту (редакція дійсна до 01.09.2022) (розміщено)  ',
		link: importDoc('doc_90939.pdf'),
	},
	{
		title:
			'Відомості про колекторські компанії, з якими укладено договір врегулювання заборгованості та порядок розгляду нею звернень громадян (які не є чинними на поточну дату) (розміщено) ',
		link: importDoc('doc_95773.pdf'),
	},
	{
		title:
			'Правила надання коштів у позику, в тому числі і на умовах фінансового кредиту (редакція дійсна до 22.08.2023) (розміщено) ',
		link: importDoc('doc_97210.pdf'),
	},
	{
		title:
			'Вартість, ціна/тарифи, розмір плати (проценти) щодо фінансової послуги з надання коштів у позику, в тому числі і на умовах фінансового кредиту (до 01.11.2023) виноска 1 (розміщено) ',
		link: importDoc('doc_97993.pdf'),
	},
	{
		title:
			'Інформація про істотні характеристики послуги з надання споживчого кредиту (без застави) (виноска 1) (розміщено)  ',
		link: importDoc('doc_97994.pdf'),
	},
	{
		title: 'Інформація щодо отримання споживчого кредиту (виноска 1) (розміщено)',
		link: importDoc('doc_97997.pdf'),
	},
	{
		title:
			'Права споживача на відмову від договору про споживчий кредит та дострокове повернення кредиту (виноска 1) (розміщено)',
		link: importDoc('doc_97999.pdf'),
	},
	{
		title:
			'Примірний договір про надання коштів у позику, у т.ч. на умовах фін. кредиту (СПОЖИВЧИЙ КРЕДИТ) з 01.09.2023 (виноска 1) (розміщено)',
		link: importDoc('doc_98002.pdf'),
	},
	{
		title: 'Паспорт споживчого кредиту (виноска 1) (розміщено)',
		link: importDoc('doc_98004.pdf'),
	},
	{
		title:
			'Форма інформаційного повідомлення за допомогою якої споживач фінансових послуг передає персональні дані третіх осіб під час укладення, виконання та припинення договору про споживчий кредит, уключаючи близьких осіб споживача фінансових послуг, які не є спадкоємцями, поручителями, майновими поручителями (виноска 1) (розміщено)  ',
		link: importDoc('doc_98005.pdf'),
	},
	{
		title:
			'Схематичне зображення структури власності ТОВ "СМАРТФІНАНС" станом на 01.01.2022 (розміщено)',
		link: importDoc('doc_98392 (1).pdf'),
	},
	{
		title:
			'Відомості про власників істотної участі ТОВ "СМАРТФІНАНС" станом на 01.01.2022 (розміщено) ',
		link: importDoc('doc_98393 (1).pdf'),
	},
	{
		title:
			'Відомості про остаточних ключових учасників у структурі власності ТОВ "СМАРТФІНАНС" станом на 01.01.2022 (розміщено)  ',
		link: importDoc('doc_98394 (1).pdf'),
	},
	{
		title:
			'Схематичне зображення структури власності юридичної особи на 22.12.2023 (розміщено) ',
		link: importDoc('doc_98935.pdf'),
	},
	{
		title:
			'Відомості про власників істотної участі ТОВ "СМАРТФІНАНС" станом на 22.12.2023 (розміщено)',
		link: importDoc('doc_98936.pdf'),
	},
	{
		title:
			'Відомості про остаточних ключових учасників у структурі власності ТОВ "СМАРТФІНАНС" станом на 22.12.2023 (розміщено) ',
		link: importDoc('doc_98937.pdf'),
	},
];

export const news: IDocumentsList[] = [
	{
		title:
			'ПОРЯДОК проведення конкурсу з відбору суб’єктів аудиторської діяльності для надання послуг обов’язкового аудиту фінансової звітності ТОВ «СМАРТФІНАНС» (розміщено) ',
		link: importDoc('doc_91140.pdf'),
	},
	{
		title:
			"Оголошення про проведення конкурсу з відбору суб'єкта аудиторської діяльності_ТОВ СМАРТФІНАНС від 05.01.2022 (розміщено) ",
		link: importDoc('doc_91141.pdf'),
	},
	{
		title:
			"Продовження конкурсу з відбору суб'єкта аудиторської діяльності_ТОВ СМАРТФІНАНС від 22.01.2022 (розміщено)  ",
		link: importDoc('doc_91142.pdf'),
	},
	{
		title:
			"Продовження конкурсу з відбору суб'єкта аудиторської діяльності_ТОВ СМАРТФІНАНС від 22.02.2022 (розміщено)   ",
		link: importDoc('doc_91143.pdf'),
	},
	{
		title:
			"Продовження конкурсу з відбору суб'єкта аудиторської діяльності_ТОВ СМАРТФІНАНС від 22.03.2022 (розміщено)  ",
		link: importDoc('doc_91144.pdf'),
	},
	{
		title:
			"Продовження конкурсу з відбору суб'єкта аудиторської діяльності_ТОВ СМАРТФІНАНС від 22.04.2022 (розміщено)  ",
		link: importDoc('doc_91145.pdf'),
	},
	{
		title:
			"Продовження конкурсу з відбору суб'єкта аудиторської діяльності_ТОВ СМАРТФІНАНС від 22.05.2022 (розміщено)  ",
		link: importDoc('doc_91146.pdf'),
	},
	{
		title:
			"Продовження конкурсу з відбору суб'єкта аудиторської діяльності_ТОВ СМАРТФІНАНС від 22.06.2022 (розміщено)  ",
		link: importDoc('doc_91147.pdf'),
	},
	{
		title:
			"Продовження конкурсу з відбору суб'єкта аудиторської діяльності_ТОВ СМАРТФІНАНС від 22.07.2022 (розміщено)",
		link: importDoc('doc_91148.pdf'),
	},
	{
		title:
			"Продовження конкурсу з відбору суб'єкта аудиторської діяльності_ТОВ СМАРТФІНАНС від 22.08.2022 (розміщено)  ",
		link: importDoc('doc_91149.pdf'),
	},
	{
		title:
			'ІНФОРМАЦІЙНЕ ПОВІДОМЛЕННЯ_про результати конкурсу аудиту_СМАРТФІНАНС 2021 (розміщено) ',
		link: importDoc('doc_91150.pdf'),
	},
	{
		title:
			"Оголошення про проведення конкурсу з відбору суб'єкта аудиторської діяльності ТОВ «СМАРТФІНАНС» від 31.01.2023 р. (розміщено)31.01.2023)  ",
		link: importDoc('doc_93839.pdf'),
	},
	{
		title:
			'ПОВІДОМЛЕННЯ ПРО ОБРАННЯ АУДИТОРСЬКОЇ ФІРМИ ДЛЯ ПРОВЕДЕННЯ АУДИТУ ЗА 2022 рік (розміщено 27.02.2023) ',
		link: importDoc('doc_93840.pdf'),
	},
];

export const disclosureOfInformation: IDocumentsList[] = [
	{
		title: 'Публічна інформація (розміщено)  ',
		link: importDoc('doc_101025.pdf'),
	},
	{
		title:
			'Інформація щодо, умов та порядку діяльності, уключно щодо фін. послуг, які надаються клієнту (розміщено) ',
		link: importDoc('doc_90936.pdf'),
	},
	{
		title: 'Свідоцтво про реєстрацію фінансової установи (розміщено)  ',
		link: importDoc('doc_90937.pdf'),
	},
	{
		title: 'Порядок обробки і захисту персональних даних (розміщено) ',
		link: importDoc('doc_90938.pdf'),
	},
	{
		title:
			'Витяг з Державного реєстру фінансових установ (про переоформлення ліцензії) (розміщено)) ',
		link: importDoc('doc_101020.pdf'),
	},
];

export const overdueDebts: IDocumentsList[] = [
	{
		title:
			'Вимоги щодо взаємодії із Позичальником (Боржником) та іншими особами при врегулюванні простроченої заборгованості за кредитним договором, Порядок взаємодії із Позичальником (Боржником) при врегулюванні простроченої заборгованості, повідомлення кредитодавця, нового кредитора та/або колекторської компанії про те, що інтереси споживача фінансових послуг при врегулюванні простроченої заборгованості представляє його уповноважений представник (ВИМОГИ ЩОДО ЕТИЧНОЇ ПОВЕДІНКИ) (розміщено)',
		link: importDoc('doc_90898.pdf'),
	},
	{
		title:
			'Відомості про колекторські компанії, з якими укладено договір врегулювання заборгованості та порядок розгляду нею звернень громадян (розміщено)',
		link: importDoc('doc_93887.pdf'),
	},
	{
		title:
			'Порядок відступлення права вимоги за договором про споживчий кредит новому кредитодавцю (розміщено)',
		link: importDoc('doc_90900.pdf'),
	},
	{
		title:
			'Перелік контактних даних кредитодавця, нового кредитора, за якими приймаються звернення споживачів фінансових послуг щодо діяльності залученої колекторської компанії (у разі залучення колекторської компанії до врегулювання простроченої заборгованості) (розміщено)',
		link: importDoc('doc_90901.pdf'),
	},
	{
		title: 'Порядок і спосіб погашення простроченої заборгованості (розміщено)',
		link: importDoc('doc_90902.pdf'),
	},
	{
		title:
			'Умови, за яких кредитодавець, новий кредитор розпочинає діяльність з врегулювання простроченої заборгованості, здійснюють відступлення права вимоги за договором про споживчий кредит новому кредитодавцю (розміщено)',
		link: importDoc('doc_90903.pdf'),
	},
	{
		title:
			'Положення про порядок організації та проведення навчання та підвищення кваліфікації працівників та осіб залучених до здійснення колекторської діяльності ТОВ «СМАРТФІНАНС» (розміщено)',
		link: importDoc('doc_90970.pdf'),
	},
	{
		title: 'Витяг з реєстру колекторських компаній (розміщено)',
		link: importDoc('doc_96492.pdf'),
	},
];
