import Accordion from '@modules/common/components/Accordion';
import DocumentsList from '@modules/common/components/DocumentsList';
import SplitBlocks from '@modules/common/components/SplitBlocks';
import {
	archivedInformation,
	disclosureOfInformation,
	financeReports,
	infoOwnershipStructure,
	news,
	overdueDebts,
} from '@modules/home/components/Reports/data';

const Reports = () => {
	return (
		<SplitBlocks title="звітність" titleType="heading" anchor="reports">
			<Accordion title="Інформація про фінустанову">
				<p>
					<strong>Відомості про підприємство</strong>
				</p>
				<br />
				<p>
					<b>ЄДРПОУ:</b> 39395137
				</p>
				<p>
					<b>Назва компанії:</b> ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛЬНІСТЮ
					&quot;СМАРТФІНАНС&quot;
				</p>
				<p>
					<b>Скорочена назва компанії:</b> ТОВ &quot;СМАРТФІНАНС&quot;
				</p>
				<p>
					<b>ПІБ керівника:</b> Дрозд Олександр Миколайович
				</p>
				<p>
					<b>Головний бухгалтер:</b> Коваль Людмила Анатоліївна
				</p>
				<p>
					<b>Місто:</b> КИЇВ
				</p>
				<p>
					<b>Поштовий індекс:</b> 03056
				</p>
				<p>
					<b>Місцезнаходження:</b> 03056, Україна, м.Київ, вул. Польова, буд.24Д
				</p>
				<br />
				<p>
					<strong>Контактні дані</strong>
				</p>
				<br />
				<p>
					<b>Контактний телефон:</b>{' '}
					<a href="tel:+380914819811" target="_blank" rel="noreferrer">
						+38(091)481-98-11
					</a>{' '}
					<br />
					Усі способи зв{`'`}язку доступні для захищеної категорії осіб. В тому числі для
					повідомлення споживачів та інших осіб про належність особи до захищеної
					категорії.
				</p>
				<br />
				<p>
					<strong>Режим робочого часу:</strong>
				</p>
				<br />
				<p>Робочі дні (крім святкових і неробочих днів):</p>
				<ul>
					<li>понеділок - четвер з 09.00 до 18.00,</li>
					<li>п{`'`}ятниця з 09.00 до 16.45</li>
				</ul>
				<p>обідня перерва з 13:00 до 13:45</p>
				<p>Вихідні дні: субота та неділя</p>
				<br />
				<p>
					Особистий прийом громадян здійснюється відповідно до затвердженого графіку:
				</p>
				<ul>
					<li>день прийому: середа першого тижня кожного місяця;</li>
					<li>час прийому: 15:00 - 16:00</li>
					<li>
						телефон для запису на прийом:{' '}
						<a href="tel:+380914819811" target="_blank" rel="noreferrer">
							+38 (091) 481-98-11
						</a>
					</li>
					<li>
						електронна адреса для запису на прийом:{' '}
						<a href="mailto:smart.finance@ukr.net" target="_blank" rel="noreferrer">
							smart.finance@ukr.net
						</a>
					</li>
				</ul>
				<br />
				<p>
					У разі припадання вихідного (неробочого) дня на середу першого тижня
					місяця, день особистого прийому переноситься на наступний робочий день.
					Прийом здійснюється за попереднім записом по телефону або електронною
					адресою.
				</p>
				<br />
				<p>
					<b>Адреси електронної пошти:</b>{' '}
					<a href="mailto:smart.finance@ukr.net" target="_blank" rel="noreferrer">
						smart.finance@ukr.net
					</a>
				</p>

				<br />
				<p>
					<strong>
						Повідомлення споживачів та інших осіб про належність їх до захищеної
						категорії приймаються
					</strong>
				</p>
				<br />
				<p>
					<b>Телефони:</b>{' '}
					<a href="tel:+380914819811" target="_blank" rel="noreferrer">
						+38(091)481-98-11
					</a>
				</p>
				<p>
					<b>Адреси електронної пошти:</b>{' '}
					<a href="mailto:smart.finance@ukr.net" target="_blank" rel="noreferrer">
						smart.finance@ukr.net
					</a>
				</p>
				<p>
					<b>Місцезнаходження:</b> 03056, Україна, м.Київ, вул. Польова, буд.24Д
				</p>
				<br />

				<p>
					<strong>
						Серія та номер свідоцтва про державну реєстрацію та запису в ЄДР юридичних
						осіб та фізичних осіб підприємців
					</strong>
				</p>
				<br />
				<p>
					<b>Дата реєстрації:</b> 16.09.2014
				</p>
				<p>
					<b>Серія:</b> -
				</p>
				<p>
					<b>Номер:</b> 1 070 102 0000 055256
				</p>
				<br />
				<p>
					<strong>
						Свідоцтво Нацфінпослуг або НКЦПФР про реєстрацію фінансової установи
					</strong>
				</p>
				<br />
				<p>
					<b>Дата реєстрації:</b> 18.02.2015
				</p>
				<p>
					<b>Реєстраційний номер:</b> 13103062
				</p>
				<p>
					<b>Серія свідоцтва:</b> ФК
				</p>
				<p>
					<b> Номер свідоцтва:</b> В0000318
				</p>
				<br />
				<p>
					<strong>Ліцензія</strong>
				</p>
				<br />
				<p>
					Фінансова компанія (ТОВ &quot;СМАРТФІНАНС&quot;) надає фінансові послуги на підставі
					ліцензії на діяльність фінансової компанії. Перелік фінансових послуг, які
					може надавати небанківська фінансова установа: факторинг; надання коштів та
					банківських металів у кредит. Дата внесення запису до Державного реєстру
					фінансових установ про переоформлення ліцензії, у зв’язку із
					переоформленням ліцензії на підставі пункту 32 розділу VII Закону України
					&quot;Про фінансові послуги та фінансові компанії&quot; та пункту 10 додатку 1 до
					Постанови № 199 - 11.03.2024. Фінансову компанію (ТОВ &quot;СМАРТФІНАНС&quot;)
					включено до Реєстру колекторських компаній // ВИТЯГ з реєстру колекторських
					компаній (Дата формування витягу: 13.06.2023. Дата включення до реєстру
					колекторських компаній 12.06.2023. Реєстраційний номер - 69. Дата і номер
					рішення про включення до реєстру колекторських компаній №21/1070-РК від
					12.06.2023)
				</p>
			</Accordion>

			<Accordion title="Врегулювання простроченої заборгованості">
				<DocumentsList list={overdueDebts} />
			</Accordion>

			<Accordion title="Розкриття інформації">
				<DocumentsList list={disclosureOfInformation} />
				<p>
					<b>
						Відомості про фінансові показники діяльності фінансової установи та її
						економічний стан, які підлягають обов{`’`}язковому оприлюдненню:
					</b>
				</p>{' '}
				<br />
				<p>
					З фінансовою звітностю ТОВ «СМАРТФІНАНС» можно ознайомитись в розділі{' '}
					<a href="/#reports" target="_blank" rel="noreferrer">
						&quot;Фінансова звітність&quot;
					</a>
				</p>
				<br />
				<p>
					З інформацією про основні показники діяльності ТОВ «СМАРТФІНАНС» на
					підставі поданої до Національного банку України звітності можна
					ознайомитись за{' '}
					<a
						href="https://bank.gov.ua/ua/statistic/supervision-statist/data-supervision"
						target="_blank"
						rel="noreferrer"
					>
						гіперпосиланням.
					</a>
				</p>
			</Accordion>

			<Accordion title="Фінансова звітність">
				<DocumentsList groupList={financeReports} />
			</Accordion>

			<Accordion title="Інформація про структуру власності">
				<DocumentsList groupList={infoOwnershipStructure} />
			</Accordion>

			<Accordion title="Новини">
				<DocumentsList list={news} />
			</Accordion>

			<Accordion title="Архівна інформація">
				<DocumentsList list={archivedInformation} />
			</Accordion>
		</SplitBlocks>
	);
};

export default Reports;
