import { FC, type ReactNode } from 'react';

import BlockTitle from '@modules/common/components/BlockTitle';
import SplitBlocks from '@modules/common/components/SplitBlocks';

const About: FC<{
	children?: ReactNode;
}> = ({ children }) => {
	return (
		<section id="about">
			<BlockTitle title="Про компанію" />

			<SplitBlocks
				title={`ТОВ «СМАРТФІНАНС»,  код за ЄДРПОУ 39395137 (далі – Товариство), є небанківською фінансовою установою, тип фінансової установи – фінансова компанія.`}
				titleType="text"
			>
				<p>
					Інформація про Товариство внесена до Державного реєстру фінансових установ,
					який веде Національний банк України.
				</p>

				<p>
					Фінансова компанія (ТОВ &quot;СМАРТФІНАНС&quot;) надає фінансові послуги на
					підставі ліцензії на діяльність фінансової компанії.
				</p>

				<p>
					Перелік фінансових послуг, які може надавати небанківська фінансова
					установа:
				</p>
				<ul>
					<li>факторинг;</li>
					<li>надання коштів та банківських металів у кредит;</li>
				</ul>

				<p>
					Дата внесення запису до Державного реєстру фінансових установ про
					переоформлення ліцензії, у зв’язку із переоформленням ліцензії на підставі
					пункту 32 розділу VII Закону України &quot;Про фінансові послуги та
					фінансові компанії&quot; та пункту 10 додатку 1 до Постанови № 199 -
					11.03.2024.
				</p>

				<p>
					Фінансову компанію (ТОВ &quot;СМАРТФІНАНС&quot;) включено до Реєстру
					колекторських компаній // ВИТЯГ з реєстру колекторських компаній (Дата
					формування витягу: 13.06.2023. Дата включення до реєстру колекторських
					компаній 12.06.2023. Реєстраційний номер - 69. Дата і номер рішення про
					включення до реєстру колекторських компаній №21/1070-РК від 12.06.2023)
				</p>

				<p>
					Для отримання повної інформації про ТОВ «СМАРТФІНАНС» щодо ліцензування,
					реєстрації та авторизації яких здійснює Національний банк України
					рекомендуємо використовувати всі засоби пошуку, які розміщені за{' '}
					<a
						href="https://bank.gov.ua/ua/supervision/nonbanks/registers-lists"
						target="_blank"
						rel="noreferrer"
					>
						посиланням
					</a>
					.
				</p>

				<p>
					Посилання на Комплексно інформаційну систему Національного банку України:{' '}
					<a href="https://kis.bank.gov.ua/" target="_blank" rel="noreferrer">
						https://kis.bank.gov.ua/
					</a>
				</p>

				<p>
					Товариство надає кредити фізичним особам-підприємцям, юридичним особам.
				</p>

				<p>
					Кредитування фізичних осіб - споживачів припинено з 01.11.2023 відповідно
					до Рішення єдиного учасника від 30.10.2023. (Товариство до 01.11.2023
					пропонувало споживачам виключно надання споживчих кредитів без забезпечення
					на суму, яка перевищувала розмір однієї мінімальної заробітньої плати,
					установленої на день укладання такого договору.
				</p>

				<p>
					Внутрішні документи щодо споживчого кредитування (до 01.11.2023) розміщені
					за{' '}
					<a href="/#reports" target="_blank" rel="noreferrer">
						посиланням
					</a>
					.
				</p>
				<p>
					Договори з надання фінансових послуг не укладаються у вигляді електронного
					документа, а укладаються тільки у присутності Клієнта, за адресою
					місцезнаходження Товариства, виключно в паперовій формі.{' '}
				</p>
				<p>
					Більше інформації про ТОВ «СМАРТФІНАНС» наведено в розділі сайту{' '}
					<a href="/#reports" target="_blank" rel="noreferrer">
						Розкриття інформації
					</a>
				</p>
			</SplitBlocks>

			{children}
		</section>
	);
};

export default About;
